import React, {useState} from 'react';
import {View, Text, Modal, Button, StyleSheet, ScrollView} from 'react-native';

const Terms = ({theme, isVisible, onClose, handleConfirm}) => {
  const [isScrollAtBottom, setIsScrollAtBottom] = useState(false);

  const handleAccept = () => {
    handleConfirm();
    onClose();
  };

  const handleScroll = (event) => {
    const {layoutMeasurement, contentOffset, contentSize} = event.nativeEvent;
    const isAtBottom =
      layoutMeasurement.height + contentOffset.y >= contentSize.height - 20; // Adjust the threshold as needed
    setIsScrollAtBottom(isAtBottom);
  };


  const styles = StyleSheet.create({
    modalContainer: {
      flex: 1,
      justifyContent: 'center',
      alignItems: 'center',
      backgroundColor: 'rgba(0, 0, 0, 0.7)',
    },
    modalContent: {
      backgroundColor: theme.colors.background,
      padding: 20,
      borderRadius: 8,
    },
    title: {
      fontSize: 24,
      fontWeight: 'bold',
      marginBottom: 10,
      color: theme.colors.text,
    },
    text: {
      marginBottom: 20,
      color: theme.colors.text,
      fontSize: 18,
    },
  });

  return (
    <Modal visible={isVisible} animationType="slide" transparent>
      <View style={styles.modalContainer}>
        <View style={styles.modalContent}>
          <Text style={styles.title}>Пользовательское соглашение ToolShare</Text>
          <ScrollView
            style={{maxHeight: '100'}}
            onScroll={handleScroll}
            scrollEventThrottle={16}
          >
            <Text style={styles.text}>
              <Text style={styles.text}>
                Добро пожаловать в приложение ToolShare! Перед использованием нашего приложения,
                пожалуйста,
                внимательно ознакомьтесь с нашим пользовательским соглашением. Этот документ содержит
                важную
                информацию о правилах и условиях использования нашего приложения для аренды
                строительного
                инструмента. При использовании нашего приложения, вы соглашаетесь соблюдать все
                нижеперечисленные условия. Если вы не согласны с этими условиями, пожалуйста, не
                используйте
                наше приложение.

                {'\n\n'}

                1. Регистрация и аккаунт{'\n'}
                1.1 Для использования приложения ToolShare вы должны зарегистрироваться и создать
                аккаунт.{'\n'}
                1.2 Вы обязуетесь предоставить точную и полную информацию при регистрации.{'\n'}
                1.3 Вы несете ответственность за безопасность своего аккаунта и пароля. Не разглашайте
                свои{'\n'}
                учетные данные третьим лицам.

                {'\n\n'}

                2. Аренда инструмента{'\n'}
                2.1 Приложение ToolShare предоставляет платформу для аренды строительного инструмента
                между
                зарегистрированными пользователями.{'\n'}
                2.2 Вы соглашаетесь использовать арендуемый инструмент только в соответствии с его
                назначением и
                производительными характеристиками.{'\n'}
                2.3 Вы обязуетесь вернуть арендованный инструмент в том же состоянии, в котором он был
                получен,
                за исключением обычного износа.{'\n'}
                2.4 Защитите арендованный инструмент от повреждений и кражи. Вы несете ответственность
                за любые
                убытки или повреждения, возникшие в результате неправильного использования или
                халатности.

                {'\n\n'}

                3. Ответственность{'\n'}
                3.1 Приложение ToolShare не несет ответственности за любые убытки, повреждения или
                травмы,
                возникшие в результате использования арендованного инструмента.{'\n'}
                3.2 Вы соглашаетесь использовать приложение ToolShare на свой собственный риск. Мы
                рекомендуем
                вам принять все необходимые меры предосторожности при использовании инструментов.

                {'\n\n'}

                4. Платежи{'\n'}
                4.1 Аренда инструмента осуществляется на платной основе. Вы соглашаетесь оплатить все
                суммы,
                указанные в приложении ToolShare.{'\n'}
                4.2 Вы предоставляете точную и актуальную информацию о платеже и соглашаетесь, что мы
                можем
                использовать эту информацию для обработки платежей.

                {'\n\n'}

                5. Конфиденциальность{'\n'}
                5.1 Мы ценим вашу конфиденциальность и обязуемся защищать ваши личные данные в
                соответствии с
                нашей политикой конфиденциальности.{'\n'}
                5.2 Мы можем использовать ваши данные для улучшения нашего приложения и предоставления
                вам более
                персонализированного опыта.

                {'\n\n'}

                6. Изменения и прекращение{'\n'}
                6.1 Мы оставляем за собой право вносить изменения в настоящее пользовательское
                соглашение в
                любое время. Изменения вступают в силус момента их публикации в приложении
                ToolShare.{'\n'}
                6.2 Мы также оставляем за собой право прекратить предоставление доступа к приложению
                ToolShare
                или приостановить его функциональность в любое время без предварительного уведомления.

                {'\n\n'}

                7. Согласие на обработку данных{'\n'}
                7.1 При использовании приложения ToolShare, вы соглашаетесь с обработкой ваших личных
                данных в
                соответствии с нашей политикой конфиденциальности.

                {'\n\n'}

                8. Интеллектуальная собственность{'\n'}
                8.1 Все права интеллектуальной собственности, связанные с приложением ToolShare,
                принадлежат нам
                или нашим лицензиаром.{'\n'}
                8.2 Запрещается воспроизводить, распространять, модифицировать или использовать наши
                товарные
                знаки, логотипы или другие материалы без нашего письменного согласия.

                {'\n\n'}

                9. Применимое право и разрешение споров{'\n'}
                9.1 Настоящее пользовательское соглашение регулируется и толкуется в соответствии с
                законодательством вашей страны проживания.{'\n'}
                9.2 Любые споры, возникающие из настоящего пользовательского соглашения, подлежат
                разрешению в
                суде вашей страны проживания.

                {'\n\n'}

                10. Связь с нами{'\n'}
                10.1 Если у вас возникли вопросы или замечания относительно нашего пользовательского
                соглашения,
                пожалуйста, свяжитесь с нами по адресу shavec3@gmail.com.

                {'\n\n'}

                Спасибо за использование приложения ToolShare! Мы надеемся, что наше приложение поможет
                вам
                удобно арендовать строительный инструмент и сделает ваш опыт безопасным и
                удовлетворительным.
              </Text>
            </Text>
          </ScrollView>
          <Button
            title="Принять"
            onPress={handleAccept}
            color={theme.colors.accent}
            disabled={!isScrollAtBottom}
          />
        </View>
      </View>
    </Modal>
  );
};

export default Terms;
